word1 = "child"
word2 = "Sololearn"

print(word1.find("i"))
print(word2.find("l"))
print(word1.find("o"))
print(word2.find())

# Функция find() проверяет, присутствует ли в строке символ (или группа символов) в строке. Функция возвращает индекс (позицию) указанного значения. Если указанное значение встречается несколько раз, функция возвращает первое вхождение (наименьший индекс).

# find() вернет -1, если значение не может быть найдено в строке.

# find() вернет ошибку, если не включить аргумент в скобках. Не имея, что искать в строке, функция не может выполнить свою задачу.